R212Warden/miniScope-STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <stdint.h>  
    

    
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
int MX_ADC1_Init(FunctionalState continuousmode, uint32_t samplingtime, uint32_t trigger, uint32_t channel);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define vbus_present_Port GPIOA
#define vbus_present_Pin GPIO_PIN_4
#define charge_enable_Port GPIOA
#define charge_enable_Pin GPIO_PIN_10
#define power_Pin GPIO_PIN_0
#define power_GPIO_Port GPIOA
#define power_EXTI_IRQn EXTI0_IRQn
#define MODE_Pin GPIO_PIN_1
#define MODE_GPIO_Port GPIOA
#define move_down_Pin GPIO_PIN_2
#define move_down_GPIO_Port GPIOA
#define move_up_Pin GPIO_PIN_3
#define move_up_GPIO_Port GPIOA
#define battery_sense_Pin GPIO_PIN_6
#define battery_sense_GPIO_Port GPIOA
#define sense_2v5_Pin GPIO_PIN_0
#define sense_2v5_GPIO_Port GPIOB
#define voltage_sense_Pin GPIO_PIN_1
#define voltage_sense_GPIO_Port GPIOB
#define FREQ_IN_Pin GPIO_PIN_8
#define FREQ_IN_GPIO_Port GPIOA
#define TX_Pin GPIO_PIN_9
#define TX_GPIO_Port GPIOA
#define RX_Pin GPIO_PIN_10
#define RX_GPIO_Port GPIOA
#define LCD_SCK_Pin GPIO_PIN_3
#define LCD_SCK_GPIO_Port GPIOB
#define LCD_CS_Pin GPIO_PIN_4
#define LCD_CS_GPIO_Port GPIOB
#define LCD_MOSI_Pin GPIO_PIN_5
#define LCD_MOSI_GPIO_Port GPIOB
#define LCD_DC_Pin GPIO_PIN_6
#define LCD_DC_GPIO_Port GPIOB
#define LCD_RES_Pin GPIO_PIN_7
#define LCD_RES_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
